# -*- coding: utf-8 -*-
import os, time
import win32com.client as win32
import datetime
import getpass
import shutil
import pyperclip
import pandas as pd
import numpy as np
from PySide6.QtWidgets import QApplication, QMainWindow, QFileDialog, QMessageBox, QDialog
from ui_WindowMain import Ui_MainWindow
from ui_WindowAnother import Ui_Dialog
from TableModel import TableModel
from HwpProcess import HwpProcess
# import category_code
# import resources
# import importlib

category_code = {10000:{'대공종':'건축','중공종':'건축일반','소공종':'건축일반','소공종코드':'10000'},
    10001:{'대공종':'건축','중공종':'건축일반','소공종':'욕실장','소공종코드':'10001'},
    10102:{'대공종':'건축','중공종':'건축기타','소공종':'건축기타','소공종코드':'10102'},
    10104:{'대공종':'건축','중공종':'건축기타','소공종':'코킹','소공종코드':'10104'},
    10201:{'대공종':'건축','중공종':'금속','소공종':'핸드레일','소공종코드':'10201'},
    10202:{'대공종':'건축','중공종':'금속','소공종':'트렌치','소공종코드':'10202'},
    10204:{'대공종':'건축','중공종':'금속','소공종':'스텐레스난간','소공종코드':'10204'},
    10205:{'대공종':'건축','중공종':'금속','소공종':'철재난간','소공종코드':'10205'},
    10206:{'대공종':'건축','중공종':'금속','소공종':'발코니난간철물','소공종코드':'10206'},
    10209:{'대공종':'건축','중공종':'금속','소공종':'쓰레기투입구','소공종코드':'10209'},
    10213:{'대공종':'건축','중공종':'금속','소공종':'철제계단','소공종코드':'10213'},
    10214:{'대공종':'건축','중공종':'금속','소공종':'잡철물','소공종코드':'10214'},
    10215:{'대공종':'건축','중공종':'금속','소공종':'우편물수취함','소공종코드':'10215'},
    10216:{'대공종':'건축','중공종':'금속','소공종':'기타','소공종코드':'10216'},
    10217:{'대공종':'건축','중공종':'금속','소공종':'카스토퍼','소공종코드':'10217'},
    10301:{'대공종':'건축','중공종':'도장','소공종':'수성페인트','소공종코드':'10301'},
    10302:{'대공종':'건축','중공종':'도장','소공종':'유성페인트','소공종코드':'10302'},
    10317:{'대공종':'건축','중공종':'도장','소공종':'기타','소공종코드':'10317'},
    10401:{'대공종':'건축','중공종':'목공사','소공종':'아트월','소공종코드':'10401'},
    10402:{'대공종':'건축','중공종':'목공사','소공종':'목공사일반','소공종코드':'10402'},
    10501:{'대공종':'건축','중공종':'미장','소공종':'미장일반','소공종코드':'10501'},
    10511:{'대공종':'건축','중공종':'미장','소공종':'기타','소공종코드':'10511'},
    10601:{'대공종':'건축','중공종':'방수','소공종':'시멘트액체방수','소공종코드':'10601'},
    10602:{'대공종':'건축','중공종':'방수','소공종':'도막방수','소공종코드':'10602'},
    10603:{'대공종':'건축','중공종':'방수','소공종':'시트방수','소공종코드':'10603'},
    10604:{'대공종':'건축','중공종':'방수','소공종':'수밀코킹','소공종코드':'10604'},
    10607:{'대공종':'건축','중공종':'방수','소공종':'아스팔트방수','소공종코드':'10607'},
    10608:{'대공종':'건축','중공종':'방수','소공종':'외벽방수','소공종코드':'10608'},
    10609:{'대공종':'건축','중공종':'방수','소공종':'조립식주택방수','소공종코드':'10609'},
    10611:{'대공종':'건축','중공종':'방수','소공종':'기타','소공종코드':'10611'},
    10612:{'대공종':'건축','중공종':'방수','소공종':'복합방수','소공종코드':'10612'},
    10801:{'대공종':'건축','중공종':'석공사','소공종':'화강석','소공종코드':'10801'},
    10802:{'대공종':'건축','중공종':'석공사','소공종':'테라조타일/판','소공종코드':'10802'},
    10803:{'대공종':'건축','중공종':'석공사','소공종':'대리석','소공종코드':'10803'},
    10804:{'대공종':'건축','중공종':'석공사','소공종':'마루굽틀','소공종코드':'10804'},
    10805:{'대공종':'건축','중공종':'석공사','소공종':'석재붙임(걸레받이)','소공종코드':'10805'},
    10806:{'대공종':'건축','중공종':'석공사','소공종':'석재붙임(바닥)','소공종코드':'10806'},
    10807:{'대공종':'건축','중공종':'석공사','소공종':'석재붙임(현관턱)','소공종코드':'10807'},
    10808:{'대공종':'건축','중공종':'석공사','소공종':'재료분리대','소공종코드':'10808'},
    10809:{'대공종':'건축','중공종':'석공사','소공종':'욕실젠다이','소공종코드':'10809'},
    10810:{'대공종':'건축','중공종':'석공사','소공종':'계단논슬립','소공종코드':'10810'},
    10813:{'대공종':'건축','중공종':'석공사','소공종':'돌붙이기','소공종코드':'10813'},
    10814:{'대공종':'건축','중공종':'석공사','소공종':'인조석','소공종코드':'10814'},
    10818:{'대공종':'건축','중공종':'석공사','소공종':'기타','소공종코드':'10818'},
    10819:{'대공종':'건축','중공종':'석공사','소공종':'마블씰','소공종코드':'10819'},
    10901:{'대공종':'건축','중공종':'수장','소공종':'도배','소공종코드':'10901'},
    10902:{'대공종':'건축','중공종':'수장','소공종':'장판','소공종코드':'10902'},
    10903:{'대공종':'건축','중공종':'수장','소공종':'마루(온돌,강,강화)','소공종코드':'10903'},
    10904:{'대공종':'건축','중공종':'수장','소공종':'걸레받이','소공종코드':'10904'},
    10905:{'대공종':'건축','중공종':'수장','소공종':'보드','소공종코드':'10905'},
    10906:{'대공종':'건축','중공종':'수장','소공종':'몰딩','소공종코드':'10906'},
    10907:{'대공종':'건축','중공종':'수장','소공종':'텍스','소공종코드':'10907'},
    10908:{'대공종':'건축','중공종':'수장','소공종':'칸막이벽','소공종코드':'10908'},
    10909:{'대공종':'건축','중공종':'수장','소공종':'우물천장','소공종코드':'10909'},
    10914:{'대공종':'건축','중공종':'수장','소공종':'단열층','소공종코드':'10914'},
    10915:{'대공종':'건축','중공종':'수장','소공종':'마루귀틀(내부)','소공종코드':'10915'},
    10916:{'대공종':'건축','중공종':'수장','소공종':'마루깔기','소공종코드':'10916'},
    10917:{'대공종':'건축','중공종':'수장','소공종':'벽지(내벽)','소공종코드':'10917'},
    10918:{'대공종':'건축','중공종':'수장','소공종':'보드(텍스)류(천장)','소공종코드':'10918'},
    10919:{'대공종':'건축','중공종':'수장','소공종':'보드류(내벽)','소공종코드':'10919'},
    10920:{'대공종':'건축','중공종':'수장','소공종':'칸막이벽(경량철골_내벽)','소공종코드':'10920'},
    10921:{'대공종':'건축','중공종':'수장','소공종':'칸막이벽(목제_내벽)','소공종코드':'10921'},
    10922:{'대공종':'건축','중공종':'수장','소공종':'기타','소공종코드':'10922'},
    10924:{'대공종':'건축','중공종':'수장','소공종':'아트월','소공종코드':'10924'},
    11001:{'대공종':'건축','중공종':'유리(거울)','소공종':'유리주위코킹(복층유리)','소공종코드':'11001'},
    11002:{'대공종':'건축','중공종':'유리(거울)','소공종':'유리','소공종코드':'11002'},
    11003:{'대공종':'건축','중공종':'유리(거울)','소공종':'샤워부스유리','소공종코드':'11003'},
    11004:{'대공종':'건축','중공종':'유리(거울)','소공종':'프레임','소공종코드':'11004'},
    11005:{'대공종':'건축','중공종':'유리(거울)','소공종':'유리주위코킹','소공종코드':'11005'},
    11006:{'대공종':'건축','중공종':'유리(거울)','소공종':'거울','소공종코드':'11006'},
    11007:{'대공종':'건축','중공종':'유리(거울)','소공종':'기타','소공종코드':'11007'},
    11101:{'대공종':'건축','중공종':'일반가구','소공종':'신발장','소공종코드':'11101'},
    11102:{'대공종':'건축','중공종':'일반가구','소공종':'거실장','소공종코드':'11102'},
    11103:{'대공종':'건축','중공종':'일반가구','소공종':'옷장','소공종코드':'11103'},
    11104:{'대공종':'건축','중공종':'일반가구','소공종':'화장대','소공종코드':'11104'},
    11105:{'대공종':'건축','중공종':'일반가구','소공종':'발코니장','소공종코드':'11105'},
    11106:{'대공종':'건축','중공종':'일반가구','소공종':'옷장','소공종코드':'11106'},
    11107:{'대공종':'건축','중공종':'일반가구','소공종':'수납선반','소공종코드':'11107'},
    11108:{'대공종':'건축','중공종':'일반가구','소공종':'코킹','소공종코드':'11108'},
    11109:{'대공종':'건축','중공종':'일반가구','소공종':'일반가구','소공종코드':'11109'},
    11110:{'대공종':'건축','중공종':'일반가구','소공종':'기타','소공종코드':'11110'},
    11201:{'대공종':'건축','중공종':'조적','소공종':'걸레받이','소공종코드':'11201'},
    11202:{'대공종':'건축','중공종':'조적','소공종':'조적공사','소공종코드':'11202'},
    11301:{'대공종':'건축','중공종':'가구','소공종':'주방가구','소공종코드':'11301'},
    11302:{'대공종':'건축','중공종':'가구','소공종':'냉장고장','소공종코드':'11302'},
    11303:{'대공종':'건축','중공종':'가구','소공종':'상부장','소공종코드':'11303'},
    11304:{'대공종':'건축','중공종':'가구','소공종':'하부장','소공종코드':'11304'},
    11305:{'대공종':'건축','중공종':'가구','소공종':'상판코킹','소공종코드':'11305'},
    11306:{'대공종':'건축','중공종':'가구','소공종':'아일랜드장','소공종코드':'11306'},
    11307:{'대공종':'건축','중공종':'가구','소공종':'장식장','소공종코드':'11307'},
    11308:{'대공종':'건축','중공종':'가구','소공종':'주방상판','소공종코드':'11308'},
    11309:{'대공종':'건축','중공종':'가구','소공종':'방열판','소공종코드':'11309'},
    11310:{'대공종':'건축','중공종':'가구','소공종':'식기건조대','소공종코드':'11310'},
    11311:{'대공종':'건축','중공종':'가구','소공종':'코킹','소공종코드':'11311'},
    11312:{'대공종':'건축','중공종':'가구','소공종':'기타','소공종코드':'11312'},
    11313:{'대공종':'건축','중공종':'가구','소공종':'후드장','소공종코드':'11313'},
    11314:{'대공종':'건축','중공종':'가구','소공종':'가스대','소공종코드':'11314'},
    11315:{'대공종':'건축','중공종':'가구','소공종':'디스펜서','소공종코드':'11315'},
    11322:{'대공종':'건축','중공종':'가구','소공종':'싱크볼','소공종코드':'11322'},
    11401:{'대공종':'건축','중공종':'가전','소공종':'렌지후드','소공종코드':'11401'},
    11402:{'대공종':'건축','중공종':'가전','소공종':'쿡탑','소공종코드':'11402'},
    11403:{'대공종':'건축','중공종':'가전','소공종':'식기세척기','소공종코드':'11403'},
    11404:{'대공종':'건축','중공종':'가전','소공종':'라이오폰/TV폰','소공종코드':'11404'},
    11405:{'대공종':'건축','중공종':'가전','소공종':'도마살균기','소공종코드':'11405'},
    11406:{'대공종':'건축','중공종':'가전','소공종':'기타','소공종코드':'11406'},
    11408:{'대공종':'건축','중공종':'가전','소공종':'음식물탈수기','소공종코드':'11408'},
    11501:{'대공종':'건축','중공종':'지붕및홈통','소공종':'아스팔트싱글','소공종코드':'11501'},
    11503:{'대공종':'건축','중공종':'지붕및홈통','소공종':'홈통','소공종코드':'11503'},
    11504:{'대공종':'건축','중공종':'지붕및홈통','소공종':'무동력흡출기','소공종코드':'11504'},
    11505:{'대공종':'건축','중공종':'지붕및홈통','소공종':'오지기와','소공종코드':'11505'},
    11506:{'대공종':'건축','중공종':'지붕및홈통','소공종':'지붕낙수구','소공종코드':'11506'},
    11507:{'대공종':'건축','중공종':'지붕및홈통','소공종':'기타','소공종코드':'11507'},
    11601:{'대공종':'건축','중공종':'창/문','소공종':'알루미늄창/문','소공종코드':'11601'},
    11602:{'대공종':'건축','중공종':'창/문','소공종':'플라스틱창/문','소공종코드':'11602'},
    11603:{'대공종':'건축','중공종':'창/문','소공종':'목재창/문','소공종코드':'11603'},
    11604:{'대공종':'건축','중공종':'창/문','소공종':'철재창/문','소공종코드':'11604'},
    11605:{'대공종':'건축','중공종':'창/문','소공종':'목재 문(욕실)','소공종코드':'11605'},
    11606:{'대공종':'건축','중공종':'창/문','소공종':'목재 창(욕실)','소공종코드':'11606'},
    11607:{'대공종':'건축','중공종':'창/문','소공종':'방충망','소공종코드':'11607'},
    11608:{'대공종':'건축','중공종':'창/문','소공종':'배관점검구','소공종코드':'11608'},
    11609:{'대공종':'건축','중공종':'창/문','소공종':'수밀코킹','소공종코드':'11609'},
    11610:{'대공종':'건축','중공종':'창/문','소공종':'창호(주방)','소공종코드':'11610'},
    11611:{'대공종':'건축','중공종':'창/문','소공종':'AL 문(욕실)','소공종코드':'11611'},
    11612:{'대공종':'건축','중공종':'창/문','소공종':'AL 창(욕실)','소공종코드':'11612'},
    11613:{'대공종':'건축','중공종':'창/문','소공종':'PL 문(욕실)','소공종코드':'11613'},
    11614:{'대공종':'건축','중공종':'창/문','소공종':'PL 창(욕실)','소공종코드':'11614'},
    11615:{'대공종':'건축','중공종':'창/문','소공종':'목재창/문(내부)','소공종코드':'11615'},
    11616:{'대공종':'건축','중공종':'창/문','소공종':'알루미늄창/문(내부)','소공종코드':'11616'},
    11617:{'대공종':'건축','중공종':'창/문','소공종':'알루미늄창/문(외부)','소공종코드':'11617'},
    11618:{'대공종':'건축','중공종':'창/문','소공종':'철재창/문(내부)','소공종코드':'11618'},
    11619:{'대공종':'건축','중공종':'창/문','소공종':'철재창/문(외부)','소공종코드':'11619'},
    11620:{'대공종':'건축','중공종':'창/문','소공종':'플라스틱창호(내부)','소공종코드':'11620'},
    11621:{'대공종':'건축','중공종':'창/문','소공종':'욕실문(목재)','소공종코드':'11621'},
    11622:{'대공종':'건축','중공종':'창/문','소공종':'욕실문(PL)','소공종코드':'11622'},
    11623:{'대공종':'건축','중공종':'창/문','소공종':'기타','소공종코드':'11623'},
    11624:{'대공종':'건축','중공종':'창/문','소공종':'목재방화문','소공종코드':'11624'},
    11625:{'대공종':'건축','중공종':'창/문','소공종':'목재문틀','소공종코드':'11625'},
    11636:{'대공종':'건축','중공종':'창/문','소공종':'ABS도어','소공종코드':'11636'},
    11637:{'대공종':'건축','중공종':'창/문','소공종':'발코니샤시','소공종코드':'11637'},
    11701:{'대공종':'건축','중공종':'철근콘크리트','소공종':'철근콘크리트','소공종코드':'11701'},
    11801:{'대공종':'건축','중공종':'타일','소공종':'타일','소공종코드':'11801'},
    11802:{'대공종':'건축','중공종':'타일','소공종':'바닥타일','소공종코드':'11802'},
    11803:{'대공종':'건축','중공종':'타일','소공종':'걸레받이타일','소공종코드':'11803'},
    11805:{'대공종':'건축','중공종':'타일','소공종':'아스타일류깔기(바닥)','소공종코드':'11805'},
    11806:{'대공종':'건축','중공종':'타일','소공종':'타일(내벽)','소공종코드':'11806'},
    11807:{'대공종':'건축','중공종':'타일','소공종':'타일(바닥)','소공종코드':'11807'},
    11808:{'대공종':'건축','중공종':'타일','소공종':'타일(외부)','소공종코드':'11808'},
    11809:{'대공종':'건축','중공종':'타일','소공종':'기타','소공종코드':'11809'},
    11901:{'대공종':'건축','중공종':'현관문','소공종':'도어락','소공종코드':'11901'},
    11902:{'대공종':'건축','중공종':'현관문','소공종':'도어클로저','소공종코드':'11902'},
    11903:{'대공종':'건축','중공종':'현관문','소공종':'현관문본체','소공종코드':'11903'},
    11904:{'대공종':'건축','중공종':'현관문','소공종':'현관문 세대호수표지판','소공종코드':'11904'},
    11905:{'대공종':'건축','중공종':'현관문','소공종':'현관문 하부씰','소공종코드':'11905'},
    11906:{'대공종':'건축','중공종':'현관문','소공종':'문틀','소공종코드':'11906'},
    11907:{'대공종':'건축','중공종':'현관문','소공종':'동출입문(강화유리)','소공종코드':'11907'},
    11908:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'기타','소공종코드':'11908'},
    11908:{'대공종':'건축','중공종':'가전','소공종':'기타','소공종코드':'11908'},
    11908:{'대공종':'건축','중공종':'현관문','소공종':'기타','소공종코드':'11908'},
    12001:{'대공종':'건축','중공종':'가전','소공종':'세탁기','소공종코드':'12001'},
    12002:{'대공종':'건축','중공종':'가전','소공종':'냉장고','소공종코드':'12002'},
    12003:{'대공종':'건축','중공종':'가전','소공종':'가스렌지','소공종코드':'12003'},
    12004:{'대공종':'건축','중공종':'가전','소공종':'책상 및 의자','소공종코드':'12004'},
    12005:{'대공종':'건축','중공종':'가전','소공종':'옷장','소공종코드':'12005'},
    12006:{'대공종':'건축','중공종':'가전','소공종':'냉장고 237L','소공종코드':'12006'},
    12007:{'대공종':'건축','중공종':'가전','소공종':'냉장고 197L','소공종코드':'12007'},
    12008:{'대공종':'건축','중공종':'가전','소공종':'냉장고 252L','소공종코드':'12008'},
    12009:{'대공종':'건축','중공종':'가전','소공종':'냉장고 145L','소공종코드':'12009'},
    12010:{'대공종':'건축','중공종':'가전','소공종':'냉장고 303L','소공종코드':'12010'},
    12011:{'대공종':'건축','중공종':'가전','소공종':'세탁기 11KG','소공종코드':'12011'},
    12012:{'대공종':'건축','중공종':'가전','소공종':'세탁기 13KG','소공종코드':'12012'},
    12013:{'대공종':'건축','중공종':'가전','소공종':'책상(1200*750*720)','소공종코드':'12013'},
    12014:{'대공종':'건축','중공종':'가전','소공종':'책상(1400*750*720)','소공종코드':'12014'},
    12015:{'대공종':'건축','중공종':'가전','소공종':'의자','소공종코드':'12015'},
    12016:{'대공종':'건축','중공종':'가전','소공종':'침대','소공종코드':'12016'},
    12017:{'대공종':'건축','중공종':'가전','소공종':'매트리스','소공종코드':'12017'},
    12018:{'대공종':'건축','중공종':'가전','소공종':'공용세탁기 13KG','소공종코드':'12018'},
    12019:{'대공종':'건축','중공종':'가전','소공종':'소파 및 테이블','소공종코드':'12019'},
    12020:{'대공종':'건축','중공종':'가전','소공종':'TV','소공종코드':'12020'},
    12021:{'대공종':'건축','중공종':'가전','소공종':'롤 스크린','소공종코드':'12021'},
    12022:{'대공종':'건축','중공종':'가전','소공종':'탁자(휴게실)','소공종코드':'12022'},
    12023:{'대공종':'건축','중공종':'가전','소공종':'의자(세탁실)','소공종코드':'12023'},
    12024:{'대공종':'건축','중공종':'가전','소공종':'옷장(이불장 겸용)500*510*1900','소공종코드':'12024'},
    12025:{'대공종':'건축','중공종':'가전','소공종':'옷장(이불장 겸용)1000*520*2000','소공종코드':'12025'},
    12026:{'대공종':'건축','중공종':'가전','소공종':'세탁기 12KG','소공종코드':'12026'},
    12027:{'대공종':'건축','중공종':'가전','소공종':'세탁기 14KG','소공종코드':'12027'},
    12028:{'대공종':'건축','중공종':'가전','소공종':'가스레인지','소공종코드':'12028'},
    12029:{'대공종':'건축','중공종':'가전','소공종':'의자(620*620*1050) ','소공종코드':'12029'},
    12030:{'대공종':'건축','중공종':'가전','소공종':'옷장(1000*510*2000) ','소공종코드':'12030'},
    12101:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'플라스틱창호(UBR)','소공종코드':'12101'},
    12102:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'목재문(UBR)','소공종코드':'12102'},
    12104:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'목창호(UBR)','소공종코드':'12104'},
    12105:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'욕조코킹(UBR)','소공종코드':'12105'},
    12106:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'코킹(UBR)','소공종코드':'12106'},
    12107:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'유리주위코킹(복층유리)(UBR)','소공종코드':'12107'},
    12108:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'프레임(UBR)','소공종코드':'12108'},
    12109:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'샤워부스유리(UBR)','소공종코드':'12109'},
    12110:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'일반유리(UBR)','소공종코드':'12110'},
    12111:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'욕실천장(UBR)','소공종코드':'12111'},
    12127:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'젠다이(UBR)','소공종코드':'12127'},
    12128:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'마블씰(UBR)','소공종코드':'12128'},
    12130:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'바닥타일(UBR)','소공종코드':'12130'},
    12131:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'벽 타일(UBR)','소공종코드':'12131'},
    12132:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'배관점검구(UBR)','소공종코드':'12132'},
    12133:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'수밀코킹(UBR)','소공종코드':'12133'},
    12135:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'알루미늄창호(UBR)','소공종코드':'12135'},
    12136:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'드레인(UBR)','소공종코드':'12136'},
    12137:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'욕조(UBR)','소공종코드':'12137'},
    12138:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'세면대(UBR)','소공종코드':'12138'},
    12139:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'변기(UBR)','소공종코드':'12139'},
    12140:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'비누받이(UBR)','소공종코드':'12140'},
    12142:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'세면대하부수납장(UBR)','소공종코드':'12142'},
    12143:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'수건선반(UBR)','소공종코드':'12143'},
    12144:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'슬라이드바(UBR)','소공종코드':'12144'},
    12145:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'코너유리선반(UBR)','소공종코드':'12145'},
    12146:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'욕조수전(UBR)','소공종코드':'12146'},
    12147:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'환풍기(UBR)','소공종코드':'12147'},
    12149:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'유리선반(UBR)','소공종코드':'12149'},
    12150:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'세면대수전(UBR)','소공종코드':'12150'},
    12151:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'샤워기수전(UBR)','소공종코드':'12151'},
    12152:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'거울(거울수납장)(UBR)','소공종코드':'12152'},
    12153:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'잡지꽂이(UBR)','소공종코드':'12153'},
    12154:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'수건걸이(UBR)','소공종코드':'12154'},
    12155:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'휴지걸이(UBR)','소공종코드':'12155'},
    12157:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'콘센트류(UBR)','소공종코드':'12157'},
    12158:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'스위치류(UBR)','소공종코드':'12158'},
    12159:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'등기구류(UBR)','소공종코드':'12159'},
    12160:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'욕실폰(UBR)','소공종코드':'12160'},
    12162:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'기타(UBR)','소공종코드':'12162'},
    12163:{'대공종':'건축','중공종':'공용욕실(UBR)','소공종':'기타','소공종코드':'12163'},
    20000:{'대공종':'기계','중공종':'기계일반','소공종':'기계일반','소공종코드':'20000'},
    20101:{'대공종':'기계','중공종':'가스설비','소공종':'배관','소공종코드':'20101'},
    20102:{'대공종':'기계','중공종':'가스설비','소공종':'밸브류','소공종코드':'20102'},
    20103:{'대공종':'기계','중공종':'가스설비','소공종':'계측기기','소공종코드':'20103'},
    20104:{'대공종':'기계','중공종':'가스설비','소공종':'가스계량기','소공종코드':'20104'},
    20105:{'대공종':'기계','중공종':'가스설비','소공종':'가스콕크','소공종코드':'20105'},
    20106:{'대공종':'기계','중공종':'가스설비','소공종':'가스관/캡','소공종코드':'20106'},
    20107:{'대공종':'기계','중공종':'가스설비','소공종':'기타','소공종코드':'20107'},
    20108:{'대공종':'기계','중공종':'가스설비','소공종':'가스타이머코크','소공종코드':'20108'},
    20201:{'대공종':'기계','중공종':'급수설비','소공종':'배관','소공종코드':'20201'},
    20202:{'대공종':'기계','중공종':'급수설비','소공종':'밸브류','소공종코드':'20202'},
    20203:{'대공종':'기계','중공종':'급수설비','소공종':'보온재','소공종코드':'20203'},
    20206:{'대공종':'기계','중공종':'급수설비','소공종':'동파방지열선','소공종코드':'20206'},
    20207:{'대공종':'기계','중공종':'급수설비','소공종':'급수계량기','소공종코드':'20207'},
    20211:{'대공종':'기계','중공종':'급수설비','소공종':'계측기기','소공종코드':'20211'},
    20212:{'대공종':'기계','중공종':'급수설비','소공종':'급수관(강관)','소공종코드':'20212'},
    20213:{'대공종':'기계','중공종':'급수설비','소공종':'급수관(동관)','소공종코드':'20213'},
    20214:{'대공종':'기계','중공종':'급수설비','소공종':'급수관(STS)','소공종코드':'20214'},
    20215:{'대공종':'기계','중공종':'급수설비','소공종':'기타','소공종코드':'20215'},
    20216:{'대공종':'기계','중공종':'급수설비','소공종':'수도꼭지','소공종코드':'20216'},
    20218:{'대공종':'기계','중공종':'급수설비','소공종':'급수관(합성수지관)','소공종코드':'20218'},
    20301:{'대공종':'기계','중공종':'급탕설비','소공종':'배관','소공종코드':'20301'},
    20303:{'대공종':'기계','중공종':'급탕설비','소공종':'밸브류','소공종코드':'20303'},
    20305:{'대공종':'기계','중공종':'급탕설비','소공종':'급탕(온수)계량기','소공종코드':'20305'},
    20307:{'대공종':'기계','중공종':'급탕설비','소공종':'보온재','소공종코드':'20307'},
    20308:{'대공종':'기계','중공종':'급탕설비','소공종':'동파방지열선','소공종코드':'20308'},
    20309:{'대공종':'기계','중공종':'급탕설비','소공종':'계측기기','소공종코드':'20309'},
    20310:{'대공종':'기계','중공종':'급탕설비','소공종':'급탕관(강관)','소공종코드':'20310'},
    20311:{'대공종':'기계','중공종':'급탕설비','소공종':'급탕관(동관)','소공종코드':'20311'},
    20312:{'대공종':'기계','중공종':'급탕설비','소공종':'급수관(STS)','소공종코드':'20312'},
    20314:{'대공종':'기계','중공종':'급탕설비','소공종':'기타','소공종코드':'20314'},
    20401:{'대공종':'기계','중공종':'기계기타','소공종':'기타','소공종코드':'20401'},
    20501:{'대공종':'기계','중공종':'난방설비','소공종':'보일러(중앙)','소공종코드':'20501'},
    20506:{'대공종':'기계','중공종':'난방설비','소공종':'보일러(개별)','소공종코드':'20506'},
    20509:{'대공종':'기계','중공종':'난방설비','소공종':'밸브류','소공종코드':'20509'},
    20513:{'대공종':'기계','중공종':'난방설비','소공종':'난방분배기','소공종코드':'20513'},
    20514:{'대공종':'기계','중공종':'난방설비','소공종':'온도조절기','소공종코드':'20514'},
    20515:{'대공종':'기계','중공종':'난방설비','소공종':'구동기','소공종코드':'20515'},
    20516:{'대공종':'기계','중공종':'난방설비','소공종':'난방유량계','소공종코드':'20516'},
    20517:{'대공종':'기계','중공종':'난방설비','소공종':'난방지시부','소공종코드':'20517'},
    20518:{'대공종':'기계','중공종':'난방설비','소공종':'보온재','소공종코드':'20518'},
    20519:{'대공종':'기계','중공종':'난방설비','소공종':'계측기기','소공종코드':'20519'},
    20522:{'대공종':'기계','중공종':'난방설비','소공종':'난방관(강관)','소공종코드':'20522'},
    20523:{'대공종':'기계','중공종':'난방설비','소공종':'난방관(동관)','소공종코드':'20523'},
    20524:{'대공종':'기계','중공종':'난방설비','소공종':'난방관(XL,PVC관)','소공종코드':'20524'},
    20525:{'대공종':'기계','중공종':'난방설비','소공종':'난방관(PB관)','소공종코드':'20525'},
    20526:{'대공종':'기계','중공종':'난방설비','소공종':'세대난방순환펌프','소공종코드':'20526'},
    20527:{'대공종':'기계','중공종':'난방설비','소공종':'기타','소공종코드':'20527'},
    20601:{'대공종':'기계','중공종':'오배수설비','소공종':'배관','소공종코드':'20601'},
    20603:{'대공종':'기계','중공종':'오배수설비','소공종':'밸브류','소공종코드':'20603'},
    20604:{'대공종':'기계','중공종':'오배수설비','소공종':'부속류','소공종코드':'20604'},
    20605:{'대공종':'기계','중공종':'오배수설비','소공종':'보온재','소공종코드':'20605'},
    20607:{'대공종':'기계','중공종':'오배수설비','소공종':'강관','소공종코드':'20607'},
    20608:{'대공종':'기계','중공종':'오배수설비','소공종':'PVC관','소공종코드':'20608'},
    20609:{'대공종':'기계','중공종':'오배수설비','소공종':'주철관','소공종코드':'20609'},
    20610:{'대공종':'기계','중공종':'오배수설비','소공종':'이중관','소공종코드':'20610'},
    20611:{'대공종':'기계','중공종':'오배수설비','소공종':'드레인','소공종코드':'20611'},
    20612:{'대공종':'기계','중공종':'오배수설비','소공종':'기타','소공종코드':'20612'},
    20701:{'대공종':'기계','중공종':'위생기구','소공종':'수전류','소공종코드':'20701'},
    20702:{'대공종':'기계','중공종':'위생기구','소공종':'욕조','소공종코드':'20702'},
    20703:{'대공종':'기계','중공종':'위생기구','소공종':'세면기','소공종코드':'20703'},
    20704:{'대공종':'기계','중공종':'위생기구','소공종':'양변기','소공종코드':'20704'},
    20705:{'대공종':'기계','중공종':'위생기구','소공종':'소변기','소공종코드':'20705'},
    20706:{'대공종':'기계','중공종':'위생기구','소공종':'휴지걸이','소공종코드':'20706'},
    20707:{'대공종':'기계','중공종':'위생기구','소공종':'비누받이','소공종코드':'20707'},
    20708:{'대공종':'기계','중공종':'위생기구','소공종':'수건걸이','소공종코드':'20708'},
    20709:{'대공종':'기계','중공종':'위생기구','소공종':'샤워세트','소공종코드':'20709'},
    20710:{'대공종':'기계','중공종':'위생기구','소공종':'욕실수납장','소공종코드':'20710'},
    20711:{'대공종':'기계','중공종':'위생기구','소공종':'거울','소공종코드':'20711'},
    20712:{'대공종':'기계','중공종':'위생기구','소공종':'음식물탈수기','소공종코드':'20712'},
    20713:{'대공종':'기계','중공종':'위생기구','소공종':'잡지꽂이','소공종코드':'20713'},
    20714:{'대공종':'기계','중공종':'위생기구','소공종':'샤워기수전','소공종코드':'20714'},
    20715:{'대공종':'기계','중공종':'위생기구','소공종':'세면대수전','소공종코드':'20715'},
    20716:{'대공종':'기계','중공종':'위생기구','소공종':'수전(손빨래,세탁기)','소공종코드':'20716'},
    20717:{'대공종':'기계','중공종':'위생기구','소공종':'스프레이건','소공종코드':'20717'},
    20718:{'대공종':'기계','중공종':'위생기구','소공종':'싱크대수전','소공종코드':'20718'},
    20719:{'대공종':'기계','중공종':'위생기구','소공종':'기타','소공종코드':'20719'},
    20720:{'대공종':'기계','중공종':'위생기구','소공종':'비데','소공종코드':'20720'},
    20721:{'대공종':'기계','중공종':'위생기구','소공종':'샤워겸용수전','소공종코드':'20721'},
    20722:{'대공종':'기계','중공종':'위생기구','소공종':'욕조수전','소공종코드':'20722'},
    21001:{'대공종':'기계','중공종':'환기설비','소공종':'동력휀','소공종코드':'21001'},
    21002:{'대공종':'기계','중공종':'환기설비','소공종':'덕트','소공종코드':'21002'},
    21003:{'대공종':'기계','중공종':'환기설비','소공종':'AD','소공종코드':'21003'},
    21004:{'대공종':'기계','중공종':'환기설비','소공종':'배기관','소공종코드':'21004'},
    21005:{'대공종':'기계','중공종':'환기설비','소공종':'배기그릴 및 방화담파','소공종코드':'21005'},
    21006:{'대공종':'기계','중공종':'환기설비','소공종':'욕실환기휀','소공종코드':'21006'},
    21007:{'대공종':'기계','중공종':'환기설비','소공종':'강제환기시스템','소공종코드':'21007'},
    21008:{'대공종':'기계','중공종':'환기설비','소공종':'기타','소공종코드':'21008'},
    21101:{'대공종':'기계','중공종':'기계복합','소공종':'기계복합','소공종코드':'21101'},
    30000:{'대공종':'기계소방','중공종':'기계소방일반','소공종':'기계소방일반','소공종코드':'30000'},
    30101:{'대공종':'기계소방','중공종':'소화설비','소공종':'소화배관','소공종코드':'30101'},
    30102:{'대공종':'기계소방','중공종':'소화설비','소공종':'스프링클러배관','소공종코드':'30102'},
    30104:{'대공종':'기계소방','중공종':'소화설비','소공종':'밸브류','소공종코드':'30104'},
    30106:{'대공종':'기계소방','중공종':'소화설비','소공종':'스프링클러헤드','소공종코드':'30106'},
    30108:{'대공종':'기계소방','중공종':'소화설비','소공종':'자동식소화기','소공종코드':'30108'},
    30109:{'대공종':'기계소방','중공종':'소화설비','소공종':'확산소화기','소공종코드':'30109'},
    30110:{'대공종':'기계소방','중공종':'소화설비','소공종':'소화기','소공종코드':'30110'},
    30117:{'대공종':'기계소방','중공종':'소화설비','소공종':'완강기','소공종코드':'30117'},
    30119:{'대공종':'기계소방','중공종':'소화설비','소공종':'기타','소공종코드':'30119'},
    50401:{'대공종':'전기','중공종':'수변전설비','소공종':'수전반','소공종코드':'50401'},
    50402:{'대공종':'전기','중공종':'수변전설비','소공종':'배전반','소공종코드':'50402'},
    50403:{'대공종':'전기','중공종':'수변전설비','소공종':'유도전압조정기','소공종코드':'50403'},
    50404:{'대공종':'전기','중공종':'수변전설비','소공종':'변압기','소공종코드':'50404'},
    50405:{'대공종':'전기','중공종':'수변전설비','소공종':'전력케이블','소공종코드':'50405'},
    50406:{'대공종':'전기','중공종':'수변전설비','소공종':'축전지','소공종코드':'50406'},
    50407:{'대공종':'전기','중공종':'수변전설비','소공종':'충전기','소공종코드':'50407'},
    50408:{'대공종':'전기','중공종':'수변전설비','소공종':'전선관(노출강관)','소공종코드':'50408'},
    50409:{'대공종':'전기','중공종':'수변전설비','소공종':'콘덴서','소공종코드':'50409'},
    50410:{'대공종':'전기','중공종':'수변전설비','소공종':'전선(옥내)','소공종코드':'50410'},
    50411:{'대공종':'전기','중공종':'수변전설비','소공종':'기타','소공종코드':'50411'},
    50701:{'대공종':'전기','중공종':'전등설비','소공종':'형광,백열등기구','소공종코드':'50701'},
    50702:{'대공종':'전기','중공종':'전등설비','소공종':'스위치류','소공종코드':'50702'},
    50703:{'대공종':'전기','중공종':'전등설비','소공종':'배선배관','소공종코드':'50703'},
    50704:{'대공종':'전기','중공종':'전등설비','소공종':'전기계량기','소공종코드':'50704'},
    50706:{'대공종':'전기','중공종':'전등설비','소공종':'글로브','소공종코드':'50706'},
    50707:{'대공종':'전기','중공종':'전등설비','소공종':'타이머','소공종코드':'50707'},
    50708:{'대공종':'전기','중공종':'전등설비','소공종':'감지기','소공종코드':'50708'},
    50709:{'대공종':'전기','중공종':'전등설비','소공종':'비상등','소공종코드':'50709'},
    50710:{'대공종':'전기','중공종':'전등설비','소공종':'센서등','소공종코드':'50710'},
    50711:{'대공종':'전기','중공종':'전등설비','소공종':'식탁등','소공종코드':'50711'},
    50712:{'대공종':'전기','중공종':'전등설비','소공종':'주방등','소공종코드':'50712'},
    50714:{'대공종':'전기','중공종':'전등설비','소공종':'기타','소공종코드':'50714'},
    50801:{'대공종':'전기','중공종':'전력간선','소공종':'배선용차단기','소공종코드':'50801'},
    50802:{'대공종':'전기','중공종':'전력간선','소공종':'제어기기,부품류','소공종코드':'50802'},
    50803:{'대공종':'전기','중공종':'전력간선','소공종':'배선','소공종코드':'50803'},
    50804:{'대공종':'전기','중공종':'전력간선','소공종':'계량기','소공종코드':'50804'},
    50805:{'대공종':'전기','중공종':'전력간선','소공종':'기타','소공종코드':'50805'},
    50901:{'대공종':'전기','중공종':'전열설비','소공종':'콘센트류','소공종코드':'50901'},
    50902:{'대공종':'전기','중공종':'전열설비','소공종':'배선배관','소공종코드':'50902'},
    50903:{'대공종':'전기','중공종':'전열설비','소공종':'분전반','소공종코드':'50903'},
    50904:{'대공종':'전기','중공종':'전열설비','소공종':'기타','소공종코드':'50904'},
    90000:{'대공종':'통신','중공종':'통신일반','소공종':'통신일반','소공종코드':'90000'},
    90101:{'대공종':'통신','중공종':'방송설비','소공종':'케이블','소공종코드':'90101'},
    90102:{'대공종':'통신','중공종':'방송설비','소공종':'스피커','소공종코드':'90102'},
    90103:{'대공종':'통신','중공종':'방송설비','소공종':'앰프','소공종코드':'90103'},
    90104:{'대공종':'통신','중공종':'방송설비','소공종':'기타','소공종코드':'90104'},
    90401:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'모기','소공종코드':'90401'},
    90402:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'인터폰(자기)','소공종코드':'90402'},
    90403:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'비디오폰(자기)','소공종코드':'90403'},
    90404:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'통신케이블','소공종코드':'90404'},
    90405:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'내선단자함','소공종코드':'90405'},
    90406:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'초인종(비디오폰)','소공종코드':'90406'},
    90407:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'홈넷,홈네트워크설비','소공종코드':'90407'},
    90408:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'비상벨','소공종코드':'90408'},
    90409:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'욕실폰','소공종코드':'90409'},
    90410:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'홈오토카메라(현관문옆)','소공종코드':'90410'},
    90411:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'적외선감지기','소공종코드':'90411'},
    90412:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'기타','소공종코드':'90412'},
    90416:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'주방TV폰','소공종코드':'90416'},
    90416:{'대공종':'건축','중공종':'인터폰(비디오폰)설비','소공종':'주방TV폰','소공종코드':'90416'},
    90417:{'대공종':'건축','중공종':'인터폰(비디오폰)설비','소공종':'욕실폰','소공종코드':'90417'},
    90417:{'대공종':'통신','중공종':'인터폰(비디오폰)설비','소공종':'욕실폰','소공종코드':'90417'},
    90501:{'대공종':'통신','중공종':'전화설비','소공종':'전화케이블','소공종코드':'90501'},
    90502:{'대공종':'통신','중공종':'전화설비','소공종':'전화단자함','소공종코드':'90502'},
    90503:{'대공종':'통신','중공종':'전화설비','소공종':'전화선','소공종코드':'90503'},
    90504:{'대공종':'통신','중공종':'전화설비','소공종':'전화콘센트','소공종코드':'90504'},
    90505:{'대공종':'통신','중공종':'전화설비','소공종':'기타','소공종코드':'90505'},
    90601:{'대공종':'통신','중공종':'통신기타','소공종':'기타','소공종코드':'90601'},
    90703:{'대공종':'통신','중공종':'TV공청설비','소공종':'분배기','소공종코드':'90703'},
    90704:{'대공종':'통신','중공종':'TV공청설비','소공종':'동축케이블','소공종코드':'90704'},
    90706:{'대공종':'통신','중공종':'TV공청설비','소공종':'TV유니트','소공종코드':'90706'},
    90707:{'대공종':'통신','중공종':'무장애센서','소공종':'기타','소공종코드':'90707'}}  # code first

class MainWindow(QMainWindow, Ui_MainWindow, HwpProcess):
    def __init__(self):
        super(MainWindow, self).__init__()
        self.w = None  # No external window yet.
        # self.setGeometry(0, 0, QScreen.availableGeometry(QApplication.primaryScreen()).width(),
        #                  QScreen.availableGeometry(QApplication.primaryScreen()).height())
        self.setupUi(self)
        self.action_W.triggered.connect(self.add_window)
        self.windows = []
        self.pushButton_2.setDisabled(True)
        self.pushButton_3.setDisabled(True)
        self.pushButton_4.setDisabled(True)
        self.pushButton_5.setDisabled(True)
        self.pushButton_6.setDisabled(True)
        self.pushButton_7.setDisabled(True)

        # 드롭다운 메뉴)
        self.action_O.triggered.connect(self.file_open)
        # self.action_O.triggered.connect(self.open_file)
        self.action_Excel_O.triggered.connect(self.open_smallxl)

        self.action_K.triggered.connect(self.init)
        self.action_K.triggered.connect(self.processOk)
        self.action_K.triggered.connect(self.process)
        # self.action_K.triggered.connect(self.processOkdsk)
        # self.action_K.triggered.connect(self.show_messagebox)

        self.action_C_2.triggered.connect(self.init)
        self.action_C_2.triggered.connect(self.processChk)
        self.action_C_2.triggered.connect(self.process)
        # self.action_C_2.triggered.connect(self.processChkdsk)
        # self.action_C_2.triggered.connect(self.show_messagebox)

        self.pushButton_1.clicked.connect(self.file_open)
        self.tableView.setSortingEnabled(True)

        self.pushButton_2.clicked.connect(self.entry_code)
        self.pushButton_2.clicked.connect(self.run_file)
        self.pushButton_2.clicked.connect(self.run_single)
        self.pushButton_2.clicked.connect(self.run_tail)
        self.tableView.setSortingEnabled(True)

        self.pushButton_3.clicked.connect(self.run_file)
        self.pushButton_3.clicked.connect(self.run_multi)
        self.pushButton_3.clicked.connect(self.run_tail)
        self.tableView.setSortingEnabled(True)

        self.pushButton_4.clicked.connect(self.load_all)
        self.pushButton_4.clicked.connect(self.show_messagebox)

        self.pushButton_5.clicked.connect(self.load_group)
        self.pushButton_5.clicked.connect(self.show_messagebox)

        self.pushButton_6.clicked.connect(self.load_jisi)
        self.pushButton_7.clicked.connect(self.load_cash)

        self.pushButton_8.clicked.connect(self.show_new_window)
        self.pushButton_9.clicked.connect(self.load_sample)

        self.tableView.doubleClicked.connect(self.get_value)

    def get_value(self, val):
        global code_number
        code_number = val.data()
        pyperclip.copy(code_number)
        # print(val.row())
        # print(val.column())
        self.label_2.setText(f'"{code_number}" 복사되었습니다.')

    def file_open(self):
        global data, df1, input_rows
        file = open("dir.txt", "r")
        data = file.read()
        file_name, _ = QFileDialog.getOpenFileName(self, self.tr("파일열기(Excel)"), data,
                                                    self.tr("Data Files (*.csv *.xls *.xlsx  *.xlsm);; All Files(*.*)"))
        dir = file_name.split('/')
        dir = dir[:-1]
        dir = '/'.join(dir)
        with open("dir.txt", "w") as file:
            file.write(dir)

        self.label_2.setText(file_name)
        df1 = pd.read_excel(file_name, skiprows=[0], skipfooter=1, index_col=[0], engine='openpyxl')
        data = df1
        model = TableModel(df1)
        self.tableView.setModel(model)
        input_rows = len(data)
        self.pushButton_1.setEnabled(True)
        self.pushButton_2.setEnabled(True)
        self.pushButton_3.setEnabled(True)
        self.pushButton_4.setDisabled(True)
        self.pushButton_5.setDisabled(True)
        self.pushButton_6.setDisabled(True)
        self.pushButton_7.setEnabled(True)

    def add_window(self):
        add_window = MainWindow()
        self.windows.append(add_window)
        add_window.show()

    def show_messagebox(self):
        msgbox = QMessageBox.information(self, "FMIS 일괄등록", "바탕화면에 다운로드 하였습니다.")
        if msgbox == QMessageBox.Yes:
             pass

    def entry_code(self):
        global text
        text = self.lineEdit_1.text()
        self.label.setText(category_code[int(text)]['소공종'])

    def run_file(self):
        try:
            global df1
            df0 = pd.read_excel('apt_code.xlsx', index_col=[0], engine='openpyxl')
            # df0['부분수선코드'] = "Y"
            df1 = df0.merge(df1, on='단지코드', how='left').dropna(subset=['동-호']).reset_index(drop=True)

            for i in range(df1.shape[0]):
                df1.loc[i, '동'] = str(df1.loc[i, '동-호']).split('-')[0]
                df1.loc[i, '호'] = str(df1.loc[i, '동-호']).split('-')[1]
            df1['동'] = df1['동'].str.zfill(4)
            df1['호'] = df1['호'].str.zfill(4)

            self.pushButton_2.setDisabled(True)
            self.pushButton_3.setDisabled(True)
            self.pushButton_4.setEnabled(True)
            self.pushButton_5.setEnabled(True)
            self.pushButton_6.setEnabled(True)
            self.pushButton_7.setEnabled(True)

        except IndexError:
            msgbox = QMessageBox.critical(self, "자료오류!", "처리할 자료에 오류가 있습니다.")
            if msgbox == QMessageBox.Yes:
                pass

    def run_multi(self):  #단일소공종
        global df1
        df1['대공종'] = df1['소공종코드'].apply(lambda x: category_code[x]['대공종'])
        df1['중공종'] = df1['소공종코드'].apply(lambda x: category_code[x]['중공종'])
        df1['소공종'] = df1['소공종코드'].apply(lambda x: category_code[x]['소공종'])
        df1['소공종코드'] = df1['소공종코드'].apply(lambda x: category_code[x]['소공종코드'])

    def run_single(self): #복합소공종
        try:
            global df1
            menu_input = int(text)  # code input
            df1['대공종'] = category_code[menu_input]['대공종']
            df1['중공종'] = category_code[menu_input]['중공종']
            df1['소공종'] = category_code[menu_input]['소공종']
            df1['소공종코드'] = category_code[menu_input]['소공종코드']

        except ValueError:
            msgbox = QMessageBox.critical(self, "FMIS 일괄등록", "소공종코드가 입력되지 않았습니다.")
            if msgbox == QMessageBox.Yes:
                self.pushButton_2.setEnabled(True)
                self.pushButton_3.setEnabled(True)
        # except(KeyError, TypeError):
        #     msgbox = QMessageBox.critical(self, "입력된 소공종코드에 오류가 있습니다.")
        #     if msgbox == QMessageBox.Yes:
        #         self.pushButton_2.setEnabled(True)
        # except:
        #     msgbox = QMessageBox.critical(self, "입력된 소공종코드에 오류가 있습니다.")
        #     if msgbox == QMessageBox.Yes:
        #         self.pushButton_2.setEnabled(True)

    def run_tail(self):
        try:
            global df1, df1_1
            df1['부분수선여부'] = np.where(df1['부분수선코드'] == 'Y', '부분수선', '전체수선')
            df1['하자구분코드'] = 'YB'
            df1['하자구분'] = '유지보수'
            df1['원인코드'] = 'N'
            df1['원인분석'] = '노후화'
            df1['보수희망일'] = ''
            df1['주말'] = 'N'
            df1['보수예정일'] = ''
            df1['연차'] = ''
            df1['구분코드'] = 'J'
            df1['시설물구분'] = '전용'
            df1['동_code'] = df1['동']
            df1['호_code'] = df1['호']
            cols = ['단지코드', '구분코드', '동', '호']
            df1['시설물ID'] = df1[cols].apply(lambda row: ''.join(row.values.astype(str)), axis=1)
            df1 = df1[['단지코드', '단지구분', '구분코드', '시설물구분', '동', '동_code', '호', '호_code',
                       '대공종', '중공종', '소공종', '소공종코드', '시설물ID', '부분수선코드', '부분수선여부', '하자구분코드',
                       '하자구분', '원인코드', '원인분석', '처리내용', '보수희망일', '주말', '보수예정일', '연차']]

            get_text = self.comboBox.currentIndex()
            if get_text == 0:
                df1['SOACK'] = ""
            if get_text == 1:
                df1['DANGA'] = ""
            if get_text == 2:
                df1['ILBAN'] = ""

            model = TableModel(df1)
            self.tableView.setModel(model)
            df1_1 = df1.copy()
            output_rows = len(df1)
            if input_rows != output_rows:
                msgBox = QMessageBox()
                msgBox.setText("Excel 자료 누락이 있습니다.")
                msgBox.exec()

        except KeyError:
            msgBox = QMessageBox()
            msgBox.setText("선택 자료(Excel)에 오류(KeyError)가 있습니다.")
            msgBox.exec()
            self.pushButton_2.setEnabled(True)
            self.pushButton_3.setEnabled(True)
            self.pushButton_4.setDisabled(True)
            self.pushButton_5.setDisabled(True)
            self.pushButton_6.setDisabled(True)
            self.pushButton_7.setDisabled(True)

        except FileNotFoundError:
            msgBox = QMessageBox()
            msgBox.setText("[apt_code.xlsx]를 찾을 수 없습니다.(FileNotFoundError)")
            msgBox.exec()
            self.pushButton_2.setEnabled(True)
            self.pushButton_3.setEnabled(True)
            self.pushButton_4.setDisabled(True)
            self.pushButton_5.setDisabled(True)
            self.pushButton_6.setDisabled(True)
            self.pushButton_7.setDisabled(True)


        except IndexError: #공용부 에러
            msgBox = QMessageBox()
            msgBox.setText("[동-호]에 공용부분이 있습니다.(IndexError)")
            msgBox.exec()
            self.pushButton_2.setEnabled(True)
            self.pushButton_3.setEnabled(True)
            self.pushButton_4.setDisabled(True)
            self.pushButton_5.setDisabled(True)
            self.pushButton_6.setDisabled(True)
            self.pushButton_7.setDisabled(True)

    def load_all(self):
        df1_1.to_excel('REGI.xlsx', index=False)
        cwd = os.getcwd()
        src = cwd
        dst = os.path.join(os.path.expanduser('~'), 'Desktop')
        shutil.move(os.path.join(src, "REGI.xlsx"),
                    os.path.join(dst, "일괄등록_" + datetime.datetime.now().strftime('%Y-%m-%d %H %M') + ".xlsx"))

    def load_group(self):
        cols1 = ['단지구분', '동', '호']
        df1['단지동호ID'] = df1[cols1].apply(lambda row: '_'.join(row.values.astype(str)), axis=1)
        for i, row in df1.iterrows():
            rows_num = (row['단지동호ID'])
            df2 = (df1.단지동호ID == rows_num)
            df2 = df1[df2]
            df2 = df2.drop(columns='단지동호ID')
            df2.to_excel('REGI_part.xlsx', index=False)
            cwd = os.getcwd()
            src = cwd
            username = getpass.getuser()
            dst = os.path.join("C:\\Users", username, "Desktop", "그룹등록" + datetime.datetime.now().strftime('%H %M'))
            if not (os.path.isdir(dst)):
                os.makedirs((os.path.join(dst)))
            shutil.move(os.path.join(src, "REGI_part.xlsx"), os.path.join(dst, rows_num + ".xlsx"))

    def load_jisi(self):
        global data
        data.columns = data.columns.str.strip()
        data = data[['단지구분', '동-호', '처리내용']]
        cols3 = ['단지구분', '동-호']
        data['단지동호'] = data[cols3].apply(lambda row: ' '.join(row.values.astype(str)), axis=1)
        data = data.groupby('단지동호', as_index=False).agg(lambda x: ' '.join(x))
        data['지시'] = data['단지동호'] + ' ' + data['처리내용']
        jisi = data[['지시']]
        model = TableModel(jisi)
        self.tableView.setModel(model)
        self.pushButton_2.setDisabled(False)
        self.pushButton_3.setDisabled(False)
        self.pushButton_4.setDisabled(True)
        self.pushButton_5.setDisabled(True)

    def load_cash(self): #수선금액(공종목록)
        try:
            global data
            df0 = pd.read_excel('apt_code.xlsx', index_col=[0], engine='openpyxl')
            data = df0.merge(data, on='단지코드', how='left').dropna(subset=['동-호']).reset_index(drop=True)

            for i in range(data.shape[0]):
                data.loc[i, '동'] = str(data.loc[i, '동-호']).split('-')[0]
                data.loc[i, '호'] = str(data.loc[i, '동-호']).split('-')[1]
            data['동-호'] = data['동'].str.zfill(4) + ' - ' + data['호'].str.zfill(4)

            data.columns = data.columns.str.strip()
            data['시설물'] = data['단지구분'] + ' ' + data['동-호']
            data['계'] = data['계'].astype(int)
            cash = data[['시설물', '계']]
            # info2 = cash.info()
            # print(info2)

            file = open("dir.txt", "r")
            data = file.read()
            file_name, _ = QFileDialog.getOpenFileName(self, self.tr("파일열기(Excel)"), data,
                                                       self.tr("Data Files (*.csv *.xls *.xlsx  *.xlsm);; All Files(*.*)"))
            dir = file_name.split('/')
            dir = dir[:-1]
            dir = '/'.join(dir)
            with open("dir.txt", "w") as file:
                file.write(dir)
            self.label_2.setText(file_name)

            noskips = pd.read_excel(file_name, index_col=[0], engine='openpyxl').reset_index(drop=False)
            noskips = noskips[['소액보수번호', '공종번호', '시설물', '대공종', '중공종', '소공종']]
            noskips = noskips.merge(cash, on='시설물', how='outer').reset_index(drop=True)
            noskips.columns = ['소액보수번호', '공종번호', '시설물', '대공종', '중공종', '소공종', '수선금액']

            data = noskips
            model = TableModel(noskips)
            self.tableView.setModel(model)

            # info = noskips.info()
            # print(info)

            noskips.to_excel('cash.xlsx', index=False)
            cwd = os.getcwd()
            src = cwd
            dst = os.path.join(os.path.expanduser('~'), 'Desktop')
            shutil.move(os.path.join(src, "cash.xlsx"),
                        os.path.join(dst, "공종목록_" + datetime.datetime.now().strftime('%Y-%m-%d %H %M') + ".xlsx"))

            msgBox = QMessageBox()
            msgBox.setText("바탕화면에 다운로드 하였습니다.")
            msgBox.exec()

        except IndexError:
            msgBox = QMessageBox()
            msgBox.setText("선택 자료(Excel)에 오류(IndexError)가 있습니다.")
            msgBox.exec()

    def load_sample(self):
        cwd = os.getcwd()
        src = cwd
        dst = os.path.join(os.path.expanduser('~'), 'Desktop')
        shutil.copy(os.path.join(src, "item6.xlsx"),
                    os.path.join(dst, "item.xlsx"))
        msgBox = QMessageBox()
        msgBox.setText("샘플(item.xlsx)을 바탕화면에 다운로드 하였습니다.")
        msgBox.exec()

    def open_smallxl(self):
        cwd = os.getcwd()
        excel = win32.gencache.EnsureDispatch('Excel.Application')
        excel.Visible = True
        excel.Workbooks.Open(cwd + '\\small_list.xlsm')

    # def smallList(self):
    #     importlib.import_module('small_list')

    def show_new_window(self, checked):
        if self.w is None:
            self.w = AnotherWindow()
        self.w.show()


class AnotherWindow(QDialog, Ui_Dialog):

    def __init__(self):
        super(AnotherWindow, self).__init__()
        self.setupUi(self)
        self.pushButton.clicked.connect(self.search_code)
        self.tableView.doubleClicked.connect(self.get_value)

    def search_code(self):
        global df1
        text2 = self.lineEdit.text()
        code = pd.DataFrame(category_code).T.reset_index()
        code = code[code['소공종'].str.contains(text2)]  # .rename(columns={'index': '소공종코드'}
        code = code[['대공종', '중공종', '소공종', '소공종코드']]
        model = TableModel(code)
        self.tableView.setModel(model)

    def get_value(self, val):
        global code_number
        code_number = val.data()
        pyperclip.copy(code_number)
        self.label.setText(f'"{code_number}" 복사되었습니다.')

app = QApplication()
window = MainWindow()
window.show()
app.exec()